erp3l/src/Documents/ОписьВложений/ОписьВложений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОписьВложений</name>
  <posting>Deny</posting>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодСценария</name>
    <type>
      <types>CatalogRef.Периоды</types>
    </type>
  </attributes>
  <attributes>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.Сценарии</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтапПроцесса</name>
    <type>
      <types>CatalogRef.УдалитьЭтапыПроцессов</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ФормируемыеДокументы</name>
    <attributes>
      <name>ВидДокумента</name>
      <type>
        <types>EnumRef.ВидыДокументовЭтапа</types>
      </type>
    </attributes>
    <attributes>
      <name>ШаблонДокумента</name>
      <type>
        <types>CatalogRef.ШаблоныТрансформационныхКорректировок</types>
        <types>CatalogRef.ПакетыПравилИмпортаТаблиц</types>
        <types>CatalogRef.ШаблоныТрансляций</types>
        <types>CatalogRef.ВидыОтчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>Состояние</name>
      <type>
        <types>EnumRef.СостоянияОтчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

erp3l/src/Documents/ОписьВложений/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Для Каждого СтрДокумент ИЗ ФормируемыеДокументы Цикл
		
		Если НЕ ЗначениеЗаполнено(СтрДокумент.ВидДокумента) Тогда
			
			Если ТипЗнч(СтрДокумент.ШаблонДокумента)=Тип("СправочникСсылка.ВидыОтчетов") Тогда
				
				СтрДокумент.ВидДокумента=Перечисления.ВидыДокументовЭтапа.ЭкземплярыОтчетов;
				
			ИначеЕсли ТипЗнч(СтрДокумент.ШаблонДокумента)=Тип("СправочникСсылка.ПакетыПравилИмпортаТаблиц") Тогда
				
				СтрДокумент.ВидДокумента=Перечисления.ВидыДокументовЭтапа.ДокументыПараллельногоУчета;
				
			ИначеЕсли ТипЗнч(СтрДокумент.ШаблонДокумента)=Тип("СправочникСсылка.ШаблоныТрансляций") Тогда
				
				СтрДокумент.ВидДокумента=Перечисления.ВидыДокументовЭтапа.ДокументыТрансляции;
				
			ИначеЕсли ТипЗнч(СтрДокумент.ШаблонДокумента)=Тип("СправочникСсылка.ШаблоныТрансформационныхКорректировок") Тогда
				
				СтрДокумент.ВидДокумента=Перечисления.ВидыДокументовЭтапа.ТрансформационныеКорректировки;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
		
КонецПроцедуры
